#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=71e59a11-8701-49ed-9360-fd6c273c1539]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=504b1e9d-360c-4a3e-85e1-df2db535e90c]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=79d2ec41-fe58-48fc-8134-37b79a153950]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c0062513-8c3e-4727-849c-d6706e2c0622]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73e3f359-8709-4fe1-9a57-cbb46105f8a2]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7ece4bd5-954c-4484-b00f-91687f159e23]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=91270246-2b85-4f0e-a675-034f90876e7f]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=acc240a8-f531-47dc-b2df-8cbaed435197]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=af7a9529-fc8f-448b-a72a-fbea17332ae9]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4c883677-33db-4afb-8cad-0db0e2722ac0]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf4197d2-3acf-4620-8d0e-fa9b8c34bd76]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f5e1694c-651c-4666-b9b5-a1a8f974eff3]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fb368ed5-3abd-401e-a6ae-6cf62c4b24da]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca7dec40-8a3d-4d12-8778-2e5ee1d2da31]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef729f29-c171-4a24-b577-9afcf1698904]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb2929ff-738b-407e-8717-c13cdb5d6df4]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6282f1b9-e1a3-4944-a309-71bc7506e4b2]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af8edbe9-cd7e-45bb-a277-0047cef330a1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa1c58fe-b390-45a2-8b80-8a547f5e1ac1]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d191c0be-d2b3-4270-a403-fbef89d05707]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c754304f-ab59-4004-902a-80951ef1c2b6]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=72148b23-94ec-4720-85db-fe2591427029]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7bd5b16c-fefe-4e95-a641-0f75dc0c47a5]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=57fe47be-e87e-4df3-a706-4ea9114fb6c4]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=730c7919-42d5-4016-bb52-785cf12f4ae4]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=16612e69-694a-4be4-b9e4-5d370f01471a]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7745dbee-3336-4404-aa78-c2d67d1c4958]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c73d46d8-f273-407e-832e-5c19f5d337d0]
module.keycloak_test.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f3b9b2ad-05d2-4ecb-82e9-9e69ab649419]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=400e247f-98d9-4a7a-8494-d32a81226d15]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fbec8a75-84b5-4354-aee6-a4a8770863fb]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c42cd3c0-ab71-41e2-89d6-ccb2c8f761e4]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4fcff8a-33c4-471b-afc2-a6e0fcbee4e7]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=23f346ae-02d1-46c4-9979-4e2a1a287f16]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d0a36090-ce9f-497a-9756-96354378e2e7]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=27269a41-42d2-4d53-a87c-00415279d8f8]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7386511f-b2b3-4a5d-bd9f-e442fc04ba19]
module.keycloak_test.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bff9bf84-64e9-4753-9494-76898dd7ca8f]
module.keycloak_test.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a0472087-20f0-4560-92f9-3ac6bfb47a9d]
module.keycloak_test.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=eb2fae7b-69d2-42ff-a0ba-f6bd204b4ba4]
module.keycloak_test.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b86bd14c-3b48-492c-ab66-b23580901c5b]
module.keycloak_test.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=634e2023-9956-46a7-9a53-647295ddd888]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c6fe139-8c73-439c-b48f-10e8475d3825]
module.keycloak_test.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9ffe3de8-fe49-4d32-b862-cd61517c063b]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a122f0b5-ec48-41f9-a869-12afe4c33a3b]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b62befee-13bf-43d9-b574-a31ce9685301]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3a8493f4-71f7-4861-9745-379e307e1361]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4f3f5cd9-b6d2-42fd-bacb-efa12781f492]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ee484ead-bfaf-4e7b-936a-428db8dd2184]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b822b48-8674-47cd-ae8c-bf2de27a25b6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "august-30-902-am-test-1255"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "august-30-902-am-test-1255"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "august-30-902-am-test-1255"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.google.ca",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "august-30-902-am-test-1255"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "august-30-902-am-test-1255"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "august-30-902-am-test-1255"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.google.ca",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "august-30-902-am-test-1255"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_august-30-902-am-test-1255.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "august-30-902-am-test-1255"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "august-30-902-am-test-1255"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.google.ca",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1862 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*